#+TITLE: EAST BibLaTeX Encoding Guidelines
#+AUTHOR: Patrick McAllister

This files describes the conventions for encoding the bibliographic
data that is collected at [[https://east.ikga.oeaw.ac.at/][EAST]] (“Epistemology and Argumentation in
South Asia and Tibet”).  The description presupposes acquaintance with
general [[http://mirrors.ctan.org/macros/latex/contrib/biblatex/doc/biblatex.pdf][BibLaTeX rules]], and that the ~.bib~ file being edited conform
to those general rules.


** ~language~ vs. ~langid~: Use ~langid~ if (any part of the) record is not English

The fields ~language~ and ~langid~ have to be distinguished:

1) ~language~: This specifies the /language of the work/ that the
   given record refers to.  It’s useful to have it, but not a
   requirement for EAST.
2) ~langid~: The value provided here influences hyphenation patterns,
   localisation strings, and capitalisation.  It defines the rules for
   typesetting this entry. Permissible values are the language names
   defined in babel (see documentation at
   https://www.ctan.org/pkg/babel).  By convention, EAST uses
   two-letter abbreviations (“bo” for Tibetan, “sa” for Sanskrit, “de”
   for German, etc.).  [@Peilin: Does this work for Chinese, Japanese,
   and Korean records too?]

~langid~ is important for display.  Its default value is English,
which is the background language on EAST.  So, this field should be
added whenever the bibliographic record is to be typeset according to
different rules than the English ones.

A simple example:

#+NAME: ravigupta1
#+begin_EXAMPLE bibtex
  @Book{east:5421,
    author =       {Ravigupta},
    title =        {tshad ma rnam 'grel gyi 'grel pa las le'u gsum pa},
    language =     {bo},
  }
#+end_EXAMPLE

This transforms into:

#+begin_SRC emacs-lisp :var bib=ravigupta1 :exports results :eval never-export
(csl-format bib)
#+end_SRC

#+RESULTS:
: <<ref-east:5421>>
: Ravigupta. n.d. /Tshad Ma Rnam 'Grel Gyi 'Grel Pa Las Le'u Gsum Pa/.


This capitalisation of the Tibetan title follows English rules since
no ~langid~ is specified.  This is not desirable.

Whereas

#+NAME: ravigupta2
#+begin_EXAMPLE bibtex
  @Book{east:5421,
    author =       {Ravigupta},
    title =        {tshad ma rnam 'grel gyi 'grel pa las le'u gsum pa},
    language =     {bo},
    langid =       {bo},
  }
#+end_EXAMPLE

turns into: 

#+begin_SRC emacs-lisp :var bib=ravigupta2 :exports results :eval never-export
(csl-format bib)
#+end_SRC

#+RESULTS:
: <<ref-east:5421>>
: Ravigupta. n.d. /tshad ma rnam 'grel gyi 'grel pa las le'u gsum pa/.


EAST prefers this latter form.

